# Parameter Type Id Panel Id Property

Source: https://www.revitapidocs.com/2026/87d271a6-ef9f-c713-33d1-f0e441f86925.htm

---

| Parameter Type Id Panel Id Property |
| --- |

"Panel"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId PanelId { get; }
```

```
Public Shared ReadOnly Property PanelId As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ PanelId {
	ForgeTypeId^ get ();
}
```

```
static member PanelId : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace